---
kind: other
id: Methods.T:Autodesk.Revit.DB.Mechanical.MEPBuildingConstruction
source: html/76a72b68-ad37-a441-a5fb-4f3ff35ee16f.htm
---
# MEPBuildingConstruction Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.